_posts/2017-07-09-Adding-a-GSL-integration-function-to-Emacs-with-a-dynamic-module.html
---
title: Adding a GSL integration function to Emacs with a dynamic module
date: 2017/07/09 07:22:01
updated: 2017/07/09 07:27:20
categories: emacs,integration,dynamic-module
tags: 
---


<p>
Here we work out how to run this program: <a href="https://www.gnu.org/software/gsl/doc/html/integration.html#adaptive-integration-example">https://www.gnu.org/software/gsl/doc/html/integration.html#adaptive-integration-example</a> in a dynamic module in emacs. The goal is to be able to evaluate \(\int_0^1 x^{1/2} \log(x) dx\). According to the example page the answer is -4. We will define an integration function that takes at least a function and integration bounds as arguments, and several optional arguments to specify tolerances and limits. In other words we want to evaluate integrals of the form:
</p>

<p>
\(\int_a^b f(x; params) dx\)
</p>

<p>
I want that to happen in an elisp function with a signature like:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(gsl-integration-qags (<span style="color: #0000FF;">lambda</span> (x params) body) a b <span style="color: #6434A3;">&amp;optional</span> params epsabs epsrel limit)
</pre>
</div>

<p>
And that function will return a list containing (result error-estimate). Here is the C-code that makes this happen. It is more complex that the <a href="http://kitchingroup.cheme.cmu.edu/blog/2017/07/08/Adding-numerical-methods-to-emacs-with-dynamic-modules/">last example</a>, and only compiles with gcc that allows nested functions. I don't know how to write this without that feature. This is more complex also because you have to create a workspace to do the integration inside the function that does the integration. The C-module also has extra code in it to allow for optional arguments.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;gsl/gsl_integration.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">"emacs-module.h"</span>

<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">plugin_is_GPL_compatible</span>;

<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">emacs_value</span> <span style="color: #006699;">F_gsl_integrate</span> (<span style="color: #6434A3;">emacs_env</span> *<span style="color: #BA36A5;">env</span>, <span style="color: #6434A3;">ptrdiff_t</span> <span style="color: #BA36A5;">nargs</span>, <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">args</span>[], <span style="color: #6434A3;">void</span> *<span style="color: #BA36A5;">data</span>)
{
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">nested function - only supported as an extension in gcc</span>
  <span style="color: #6434A3;">double</span> <span style="color: #006699;">f</span> (<span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">x</span>, <span style="color: #6434A3;">void</span> *<span style="color: #BA36A5;">params</span>) 
  {
    <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">fn</span> = args[0];  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">function we will integrate</span>
    <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">x2</span>[] = { env-&gt;make_float(env, x), params };
    <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">y</span> = env-&gt;funcall(env, fn, 2, &amp;x2);   
    
    <span style="color: #0000FF;">return</span> env-&gt;extract_float (env, y);
  }

  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">a</span> = env-&gt;extract_float (env, args[1]);
  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">b</span> = env-&gt;extract_float (env, args[2]);

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">default values for optional arguments</span>
  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">epsabs</span> = 0.0;
  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">epsrel</span> = 1e-7;
  <span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">limit</span> = 1000;
  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">result</span>, <span style="color: #BA36A5;">error</span>; 

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Here is how I handle the optional arguments</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">(gsl-integrate func a b params epsabs epsrel limit)</span>
  <span style="color: #6434A3;">gsl_function</span> <span style="color: #BA36A5;">F</span>;
  F.function = &amp;f;
  <span style="color: #0000FF;">if</span> (nargs &gt;= 4) {F.params = args[3];}
  <span style="color: #0000FF;">if</span> (nargs &gt;= 5 &amp;&amp; env-&gt;is_not_nil(env, args[4])) {epsabs = env-&gt;extract_float(env, args[4]);}
  <span style="color: #0000FF;">if</span> (nargs &gt;= 6 &amp;&amp; env-&gt;is_not_nil(env, args[5])) {epsrel = env-&gt;extract_float(env, args[5]);}
  <span style="color: #0000FF;">if</span> (nargs &gt;= 7 &amp;&amp; env-&gt;is_not_nil(env, args[6])) {limit = env-&gt;extract_integer(env, args[6]);}

  <span style="color: #6434A3;">gsl_integration_workspace</span> * <span style="color: #BA36A5;">w</span> = gsl_integration_workspace_alloc (limit);

  gsl_integration_qags (&amp;F, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">gsl_function pointer</span>
                        a, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">lower integration bound</span>
                        b, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">upper integration bound</span>
                        epsabs, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">absolute error tolerance</span>
                        epsrel, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">relative error tolerance</span>
                        limit, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">max number of subintervals for integration</span>
                        w, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">the workspace</span>
                        <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">pointers to put results and error in</span>
                        &amp;result, &amp;error);

  gsl_integration_workspace_free (w);
    
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">make a list of (result error) to return</span>
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">Qlist</span> = env-&gt;intern(env, <span style="color: #008000;">"list"</span>);
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">Qresult</span> = env-&gt;make_float (env, result);
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">Qerror</span> = env-&gt;make_float (env, error);
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">list_args</span>[] = { Qresult, Qerror };
  <span style="color: #0000FF;">return</span> env-&gt;funcall(env, Qlist, 2, list_args);
}

<span style="color: #6434A3;">int</span> <span style="color: #006699;">emacs_module_init</span>(<span style="color: #0000FF;">struct</span> <span style="color: #6434A3;">emacs_runtime</span> *<span style="color: #BA36A5;">ert</span>)
{
  <span style="color: #6434A3;">emacs_env</span> *<span style="color: #BA36A5;">env</span> = ert-&gt;get_environment(ert);
  
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Here we create the function.</span>
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">fset</span> = env-&gt;intern(env, <span style="color: #008000;">"fset"</span>);
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">args</span>[2];
  args[0] = env-&gt;intern(env, <span style="color: #008000;">"gsl-integration-qags"</span>); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">symbol to create for function</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">The function we set that symbol to.</span>
  args[1] = env-&gt;make_function(env,
                               3, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">min nargs</span>
                               7, <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">max nargs</span>
                               F_gsl_integrate,
                               <span style="color: #008000;">"(gsl-integration-qags F A B &amp;optional PARAMS EPSABS EPSREL LIMIT)\n"</span> \
                               <span style="color: #008000;">"Integrate F(x; params) from A to B.\n"</span> \
                               <span style="color: #008000;">"F is a function of a single variable and parameters.\n"</span> \
                               <span style="color: #008000;">"A is the lower bound of integration\n"</span>  \
                               <span style="color: #008000;">"B is the upper bound of integration.\n"</span> \
                               <span style="color: #008000;">"Optional parameters:\n"</span>\
                               <span style="color: #008000;">"PARAMS is a list of params to pass to F.\n"</span> \
                               <span style="color: #008000;">"EPSABS is a float (default 0.0) and is the absolute error tolerance.\n"</span> \
                               <span style="color: #008000;">"EPSREL is a float (default 1e-7) and is the relative error tolerance.\n"</span> \
                               <span style="color: #008000;">"LIMIT is the maximum number of subintervals for the integration (default 1000).\n"</span> \
                               <span style="color: #008000;">"Returns (list result error-estimate).\n"</span> \
                               <span style="color: #008000;">"See https://www.gnu.org/software/gsl/manual/html_node/QAGS-adaptive-integration-with-singularities.html."</span>,
                               0);
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">This is basically (fset 'gsl-integration-qags (lambda func))</span>
  env-&gt;funcall(env, fset, 2, args);
  
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">This is what allows the shared library to provide a feature </span>
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">provide</span> = env-&gt;intern(env, <span style="color: #008000;">"provide"</span>);
  <span style="color: #6434A3;">emacs_value</span> <span style="color: #BA36A5;">provide_args</span>[] = { env-&gt;intern(env, <span style="color: #008000;">"gsl-integration"</span>) };
  env-&gt;funcall(env, provide, 1, provide_args);
  
  <span style="color: #0000FF;">return</span> 0;
}
</pre>
</div>

<p>
Building this was moderately tricky. It appears the first gcc on my path uses clang which does not support nested functions in C. I don't know enough C to figure out how to do this without a nested function though, since the function has to be defined at run-time based on the emacs env and args. gcc does support inline functions, so the code below uses a gcc that does compile it.
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -f gsl-integration.so gsl-integration.o
/usr/local/Cellar/gcc/6.1.0/bin/gcc-6 -Wall -I/usr/local/include -fPIC -c gsl-integration.c
/usr/local/Cellar/gcc/6.1.0/bin/gcc-6  -shared -L/usr/local/include -lgsl -o gsl-integration.so gsl-integration.o
</pre>
</div>

<p>
Now we add this directory to our path since it is not on it and require our new module.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #008000;">"/Users/jkitchin/vc/blogofile-jkitchin.github.com/_blog/dynamic-module/"</span>)
(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">gsl-integration</span>)
</pre>
</div>

<p>
Let us see our new function in action. We evaluate \(\int_0^1 x^{1/2} \log(x) dx\). According to the example page the answer is -4. Here is an example where we ignore the parameters. You have to be careful; Emacs sometimes segfaults and crashes if you use an integer or float argument when it expects the other type.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(gsl-integration-qags (<span style="color: #0000FF;">lambda</span> (x params) (/ (log x) (sqrt x))) 0.0 1.0)
</pre>
</div>

<p>
Here are some optional arguments. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(gsl-integration-qags (<span style="color: #0000FF;">lambda</span> (x params) (/ (log x) (sqrt x))) 0.0 1.0 nil nil 0.01)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">-4.000000000000075</td>
<td class="org-right">0.019526557540360034</td>
</tr>
</tbody>
</table>

<p>
Nice, with a larger epsrel argument we get a larger error. Note the arguments are positional, so we have to include them all just to set the epsrel argument. How about an easier example with parameters that we actually use. Here we integrate a constant, and set the value of the constant from the params arg. The integral should be the area of a rectangle of length 1 and width of the param we use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(list
 (gsl-integration-qags (<span style="color: #0000FF;">lambda</span> (x params) (first params)) 0.0 1.0 '(1.0))
 (gsl-integration-qags (<span style="color: #0000FF;">lambda</span> (x params) (first params)) 0.0 1.0 '(0.5)))
</pre>
</div>

<p>
Wow! It actually works!!! That was harder won success than usual for me. I am claiming victory for now and leaving the following notes to future me:
</p>

<ol class="org-ol">
<li>It would be nice to have optional keyword arguments. This would take some handling of the arguments beyond what I know how to do for now, unless it is possible to pull in something like plist-get the way we pull in fset, provide and list in this example.</li>
<li>Error checking on types would be helpful. It is not good for Emacs to crash because 0 is not 0.0!</li>
<li>In numpy there is often a feature to get full_output. Here, the workspace created in the function has more information available in a struct that might be helpful to have access to at times. It seems like it might be possible to get that here too.</li>
</ol>
<p>Copyright (C) 2017 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2017/07/09/Adding-a-GSL-integration-function-to-Emacs-with-a-dynamic-module.org">org-mode source</a></p>
<p>Org-mode version = 9.0.7</p>